# Agregar y eliminar filas y columnas de un data frame, combinar informaci√≥n de varias columnas en una sola

In [1]:
import numpy as np
import pandas as pd

In [2]:
# Vamos a crear un diccionario para utilizarlo como ejemplo
people = {
    "first":["Andres", "Omar", "Miguel"],
    "last":["Galarraga", "Vizquel", "Cabrera"],
    "email":["andres@gmail.com", "omar@email.com", "miguel@email.com"]
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first       last             email
0  Andres  Galarraga  andres@gmail.com
1    Omar    Vizquel    omar@email.com
2  Miguel    Cabrera  miguel@email.com

# Columnas

## 1. Agregar una columna

In [5]:
# Primero vamos a unir las columnas de first y last para obtener la columna "full_name"
df['first'] + " " + df['last']

0    Andres Galarraga
1        Omar Vizquel
2      Miguel Cabrera
dtype: object

In [6]:
# Ahora asignamos la formulario anterior a nuestra nueva columna 'full_name'
df['full_name'] = df['first'] + " " + df['last']

In [7]:
# Si vemos nuevamente el Data Frame aparece la nueva columna al final
df

    first       last             email         full_name
0  Andres  Galarraga  andres@gmail.com  Andres Galarraga
1    Omar    Vizquel    omar@email.com      Omar Vizquel
2  Miguel    Cabrera  miguel@email.com    Miguel Cabrera

## 2. Eliminar una columna - df.drop()

In [8]:
# Para eliminar una columna utilizamos la funcion "drop() y el argumento 'columns'"
# Utilizamos inplace = True, para que se aplique directo al Data Frame
df.drop(columns = ['first', 'last'], inplace = True)

In [9]:
df

              email         full_name
0  andres@gmail.com  Andres Galarraga
1    omar@email.com      Omar Vizquel
2  miguel@email.com    Miguel Cabrera

## 3. Separar valores de una columna de string con "split" y expand=True

In [10]:
# Vamos a realizar primero la operacion, para comprobar que se ejecutar de manera correcta
df['full_name'].str.split(' ', expand = True)

        0          1
0  Andres  Galarraga
1    Omar    Vizquel
2  Miguel    Cabrera

In [11]:
# Ahora como sabemos que se ejecuta de forma correcta, vamos a crear las dos columnas y asignarle esa operacion
df[['first', 'last']] = df['full_name'].str.split(' ', expand = True)

In [12]:
df

              email         full_name   first       last
0  andres@gmail.com  Andres Galarraga  Andres  Galarraga
1    omar@email.com      Omar Vizquel    Omar    Vizquel
2  miguel@email.com    Miguel Cabrera  Miguel    Cabrera

# Filas

## 1. Agregar solo una fila de valores - df.append()

In [13]:
# Para agregar solo una fila de valores, podemos utilizar un diccionario 
df.append({'first':'Bob', 'last':'Abreu', 'full_name':'Bob Abreu', 'email':'bob@email.com'}, ignore_index = True)

C:\Users\equipo\AppData\Local\Temp\ipykernel_792\4212772383.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'first':'Bob', 'last':'Abreu', 'full_name':'Bob Abreu', 'email':'bob@email.com'}, ignore_index = True)

              email         full_name   first       last
0  andres@gmail.com  Andres Galarraga  Andres  Galarraga
1    omar@email.com      Omar Vizquel    Omar    Vizquel
2  miguel@email.com    Miguel Cabrera  Miguel    Cabrera
3     bob@email.com         Bob Abreu     Bob      Abreu

In [14]:
df

              email         full_name   first       last
0  andres@gmail.com  Andres Galarraga  Andres  Galarraga
1    omar@email.com      Omar Vizquel    Omar    Vizquel
2  miguel@email.com    Miguel Cabrera  Miguel    Cabrera

## 2. Agregar valores desde otra tabla de datos

In [15]:
# Primero creamos una tabla nueva 
people = {
    "first":["Jose", "Bob", "Alexis"],
    "last":["Altuve", "Abreu", "Amarista"],
    "email":["jose@gmail.com", "bob@email.com", "alexis@email.com"]
}

df2 = pd.DataFrame(people)

In [16]:
df2

    first      last             email
0    Jose    Altuve    jose@gmail.com
1     Bob     Abreu     bob@email.com
2  Alexis  Amarista  alexis@email.com

In [17]:
# Ahora lo que hacemos es agregar la tabla nueva "df2" a la primera tabla
df.append(df2, ignore_index=True, sort=False)
# Debemos colocar "ignore_index=True", porque las columnas no estan en el mismo orden

C:\Users\equipo\AppData\Local\Temp\ipykernel_792\3829768107.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df2, ignore_index=True, sort=False)

              email         full_name   first       last
0  andres@gmail.com  Andres Galarraga  Andres  Galarraga
1    omar@email.com      Omar Vizquel    Omar    Vizquel
2  miguel@email.com    Miguel Cabrera  Miguel    Cabrera
3    jose@gmail.com               NaN    Jose     Altuve
4     bob@email.com               NaN     Bob      Abreu
5  alexis@email.com               NaN  Alexis   Amarista

In [18]:
# Para aplicarse la operacion, debemos sobreescribir el data frame
df = df.append(df2, ignore_index=True, sort=False)

C:\Users\equipo\AppData\Local\Temp\ipykernel_792\344555859.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index=True, sort=False)

In [19]:
df

              email         full_name   first       last
0  andres@gmail.com  Andres Galarraga  Andres  Galarraga
1    omar@email.com      Omar Vizquel    Omar    Vizquel
2  miguel@email.com    Miguel Cabrera  Miguel    Cabrera
3    jose@gmail.com               NaN    Jose     Altuve
4     bob@email.com               NaN     Bob      Abreu
5  alexis@email.com               NaN  Alexis   Amarista

## 3. Eliminar valores de una fila con drop() - Seleccion por indice

In [20]:
df.drop(index = 5)

              email         full_name   first       last
0  andres@gmail.com  Andres Galarraga  Andres  Galarraga
1    omar@email.com      Omar Vizquel    Omar    Vizquel
2  miguel@email.com    Miguel Cabrera  Miguel    Cabrera
3    jose@gmail.com               NaN    Jose     Altuve
4     bob@email.com               NaN     Bob      Abreu

## 4. Eliminar valores de una o varias filas con un condicional

In [21]:
# Para hacerlo creamos una variable filtro
filt = df['last'] == 'Abreu'

In [22]:
# Luego eliminamos aplicando el mismo metodo de "index"
df.drop(index = df[filt].index)

              email         full_name   first       last
0  andres@gmail.com  Andres Galarraga  Andres  Galarraga
1    omar@email.com      Omar Vizquel    Omar    Vizquel
2  miguel@email.com    Miguel Cabrera  Miguel    Cabrera
3    jose@gmail.com               NaN    Jose     Altuve
5  alexis@email.com               NaN  Alexis   Amarista